package com.kitri.pos;

import javax.swing.JPanel;
import javax.swing.JTable;
import javax.swing.ListSelectionModel;
import javax.swing.table.DefaultTableModel;

import java.awt.Font;
import java.util.Vector;

import javax.swing.JScrollPane;

public class StockMonitor extends JPanel {
	JTable StockTable;
	DefaultTableModel tmodel;
	JScrollPane stockScrollPane;

	/**
	 * Create the panel.
	 */
	public StockMonitor() {
		setLayout(null);

		stockScrollPane = new JScrollPane();
		stockScrollPane.setBounds(12, 10, 1133, 532);
		add(stockScrollPane);
				

		// [테이블]
		// 임시 테이블 모델 생성
//		String header[] = {"상품코드", "입고일자", "상품명", "수량", "가격", "유통기한"};
//		String contents[][] = { {"FAS-101", "20190408", "참이슬 클래식", "40", "1650", ""},
//				{"FAS-102", "20190408", "처음처럼", "40", "1650", ""},
//				{"FAS-103", "20190408", "좋은데이", "40", "1650", ""},
//				{"FAS-104", "20190408", "참이슬후레쉬", "40", "1650", ""},
//				{"FAS-105", "20190409", "참이슬 오리지널", "40", "1650", ""},
//				{"FAS-106", "20190409", "순하리 유자", "40", "1750", ""},
//				{"FAS-107", "20190409", "순하리 복숭아", "40", "1750", ""},
//				{"FAS-108", "20190410", "순하리 사과", "40", "1750", ""},
//				{"FAS-109", "20190410", "자몽에 이슬", "40", "1750"},
//				{"FAS-110", "20190412", "청포도에 이슬", "40", "1750"}, 
//				{"FAS-110", "20190412", "청포도에 이슬", "40", "1750"}, 
//				{"FAS-110", "20190412", "청포도에 이슬", "40", "1750"}, 
//				{"FAS-110", "20190412", "청포도에 이슬", "40", "1750"}, 
//				{"FAS-110", "20190412", "청포도에 이슬", "40", "1750"}, 
//				{"FAS-110", "20190412", "청포도에 이슬", "40", "1750"}, 
//				{"FAS-110", "20190412", "청포도에 이슬", "40", "1750"}, 
//				{"FAS-110", "20190412", "청포도에 이슬", "40", "1750"}, 
//				{"FAS-110", "20190412", "청포도에 이슬", "40", "1750"}, 
//				{"FAS-110", "20190412", "청포도에 이슬", "40", "1750"}, 
//				{"FAS-110", "20190412", "청포도에 이슬", "40", "1750"}, 
//				{"FAS-110", "20190412", "청포도에 이슬", "40", "1750"}, 
//				{"FAS-110", "20190412", "청포도에 이슬", "40", "1750"}, 
//				{"FAS-110", "20190412", "청포도에 이슬", "40", "1750"}, 
//				{"FAS-110", "20190412", "청포도에 이슬", "40", "1750"}, 
//				{"FAS-110", "20190412", "청포도에 이슬", "40", "1750"}, 
//				{"FAS-110", "20190412", "청포도에 이슬", "40", "1750"}, 
//				{"FAB-101", "20190413", "하이트", "30", "2750","20200201"}, 
//				{"FAB-102", "20190412", "카스", "30", "2750","20200201"}, 
//				{"FAB-103", "20190413", "클라우드", "30", "2750","20200201"}, 
//				{"FAB-103", "20190413", "클라우드", "30", "2750","20200201"}, 
//				{"FAB-103", "20190413", "클라우드", "30", "2750","20200201"}, 
//				{"FAB-103", "20190413", "클라우드", "30", "2750","20200201"}, 
//				{"FAB-103", "20190413", "클라우드", "30", "2750","20200201"}, 
//				{"FAB-103", "20190413", "클라우드", "30", "2750","20200201"}, 
//				{"FAB-103", "20190413", "클라우드", "30", "2750","20200201"}, 
//				{"FAB-103", "20190413", "클라우드", "30", "2750","20200201"}, 
//				{"FAB-103", "20190413", "클라우드", "30", "2750","20200201"}, 
//				{"FAB-103", "20190413", "클라우드", "30", "2750","20200201"}, 
//				{"FAB-103", "20190413", "클라우드", "30", "2750","20200201"}, 
//				{"FAB-104", "20190410", "버드와이저", "30", "3750","20200201"}, 
//				{"FAB-105", "20190412", "칭따오", "30", "3750","20200201"}, 
//				{"FAB-106", "20190410", "블랑1664", "30", "3750","20200201"}, 
//				{"FAB-107", "20190411", "아사히", "30", "3750","20200201"}, 
//				{"FAB-108", "20190411", "하이네켄", "30", "3750","20200201"}	};
		
		
//		tmodel = new DefaultTableModel(contents, header);
		
		Vector<String> col = new Vector<String>(); // 열
		col.add("상품코드");
		col.add("입고일자");
		col.add("상품명");
		col.add("수량");
		col.add("가격");
		col.add("유통기한");
		tmodel = new DefaultTableModel(col, 0);
		
		StockTable = new JTable(tmodel);
		StockTable.setRowMargin(10);
		StockTable.setRowHeight(30);
		// 테이블 값 가운데 정렬
		MainFrame.tableCellCenter(StockTable);

		stockScrollPane.setViewportView(StockTable);
		
		StockTable.setFont(new Font("맑은 고딕", Font.PLAIN, 15));
		StockTable.setSelectionMode(ListSelectionModel.SINGLE_SELECTION);
		
		

	}
	
	
}
